load-test/simple-test.yaml
config:
  target: "wss://socketio-loadtest.herokuapp.com"
  socketio:
    transports: ["websocket"]
  phases:
    - duration: 10 # Run scenario for 10 seconds
      arrivalCount: 20 # Create 20 virtual users per scenario
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "add user"
          data: "John Doe"
      - emit:
          channel: "new message"
          data: "Hello! {{ $randomString() }}"
      - think: 5 # do nothing for 5 seconds, then disconnect